# Python Fundamentals

In [1]:
# Import numpy and pandas library
import numpy as np
import pandas as pd

### <u>Task 1</u>
There are three different tables. Please make three dataframe in python and save them as three .csv files. From Task 2 to Task 10, use the saved .csv files only

In [2]:
# Creating DataFrame 1
DataFrame1={'ID':['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005'],
           'Project':['Project 1','Project 2','Project 3','Project 4','Project 5','Project 6','Project 7','Project 8','Project 9','Project 10','Project 11','Project 12','Project 13','Project 14']
           ,'Cost':[1002000,2000000,4500000,5500000,'',680000,400000,350000,'',300000,2000000,1000000,3000000,200000]
           ,'Status':['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing','Finished','Failed','Ongoing','Finished','Finished']}
# Creating DataFrame 2
DataFrame2={'ID':['A001','A002','A003','A004','A005']
            ,'Name':['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny']
            ,'Gender':['M','F','M','F','F']
            ,'City':['Paris','London','Berlin','Newyork','Madrid']
            ,'Age':[25,27,29,31,30]}
# Creating DataFrame 3
DataFrame3={'ID':['A001','A002','A003','A004','A005']
            ,'Designation Level':[2,2,3,2,3]}

# Converting to DataFrames
Project_DataFrame=pd.DataFrame(DataFrame1)
Employee_DataFrame=pd.DataFrame(DataFrame2)
SeniorityLevel_DataFrame=pd.DataFrame(DataFrame3)

# Saving to CSV files
Project_DataFrame.to_csv("Project.csv",index=False)
Employee_DataFrame.to_csv("Employee.csv",index=False)
SeniorityLevel_DataFrame.to_csv("Seniority_Level.csv",index=False)

### <u>Task 2</u>
The cost column in the dataframe "Project" has some missing values. Your task is to compute there missing values. Replace the missing values by running average. You should use the "For" loop for this task.

In [3]:
# Read Project.csv file
Project=pd.read_csv("Project.csv")

Project['Cost'] = pd.to_numeric(Project['Cost'], errors='coerce')

# Initialize count and temp_sum(running sum)
count=0
temp_sum=0

# Loop through each value in the 'Cost' column
for i in Project['Cost']:
    # If the value is missing (NaN)
    if pd.isna(i):
        if count>0:
            mean_value=temp_sum/count
            Project.loc[count,'Cost']=int(mean_value) # Replace missing value with running average
            temp_sum=temp_sum+int(mean_value)
            count=count+1
    else :
        count=count+1
        temp_sum=temp_sum+i

# Save updated file
Project.to_csv("Project.csv",index=False)

Project

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.0   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

### <u>Task 3</u>
Split the name column in the Employee dataframe into two new columns "First Name", and "Last Name" and remove the older "name" column.

In [4]:
# Read Employee.csv file
Employee=pd.read_csv("Employee.csv")

# Split the 'Name' column into 'First Name' and 'Last Name'
# n=1 (splits only at the first space)
Employee[['First Name','Last Name']]=Employee['Name'].str.split(' ', n=1, expand=True)

# Drop the original 'Name' column
Employee.drop('Name',axis=1, inplace=True)

# Rearrange columns
column=['ID','First Name','Last Name','Gender','City','Age']
Employee=Employee[column]

# Save updated file
Employee.to_csv("Employee.csv",index=False)

Employee

     ID First Name  Last Name Gender     City  Age
0  A001       John      Alter      M    Paris   25
1  A002      Alice  Luxumberg      F   London   27
2  A003        Tom  Sabestine      M   Berlin   29
3  A004       Nina      Adgra      F  Newyork   31
4  A005        Amy      Johny      F   Madrid   30

### <u>Task 4</u>
Join all three dataframes in one single dataframe. Name it "Final"

In [5]:
# Read all CSV files
Project=pd.read_csv("Project.csv")
Employee=pd.read_csv("Employee.csv")
Seniority_Level=pd.read_csv("Seniority_Level.csv")

# First join Project and Employee
temp_Final=pd.merge(Project,Employee,on='ID', how='inner')
# Then join with Seniority_Level
Final=pd.merge(temp_Final,Seniority_Level, on='ID', how='inner')

Final

,ID,Project,Cost,Status,First Name,Last Name,Gender,City,Age,Designation Level
0,A001,Project 1,1002000.0,Finished,John,Alter,M,Paris,25,2
1,A002,Project 2,2000000.0,Ongoing,Alice,Luxumberg,F,London,27,2
2,A003,Project 3,4500000.0,Finished,Tom,Sabestine,M,Berlin,29,3
3,A004,Project 4,5500000.0,Ongoing,Nina,Adgra,F,Newyork,31,2
4,A005,Project 5,3250500.0,Finished,Amy,Johny,F,Madrid,30,3
5,A002,Project 6,680000.0,Failed,Alice,Luxumberg,F,London,27,2
6,A005,Project 7,400000.0,Finished,Amy,Johny,F,Madrid,30,3
7,A003,Project 8,350000.0,Failed,Tom,Sabestine,M,Berlin,29,3
8,A001,Project 9,2210312.0,Ongoing,John,Alter,M,Paris,25,2
9,A003,Project 10,300000.0,Finished,Tom,Sabestine,M,Berlin,29,3
10,A001,Project 11,2000000.0,Failed,John,Alter,M,Paris,25,2
11,A004,Project 12,1000000.0,Ongoing,Nina,Adgra,F,Newyork,31,2
12,A004,Project 13,3000000.0,Finished,Nina,Adgra,F,Newyork,31,2
13,A005,Project 14,200000.0,Finished,Amy,Johny,F,Madrid,30,3

### <u>Task 5</u>
Add a new bonus column in the Final dataframe. Give a 5% bonus concerning a project cost only to employees who have finished the projects.

In [6]:
# Initialize new column 'Bonus' with 0
Final['Bonus']=0

# Give 5% bonus of cost only to employees with 'Finished' projects
Final.loc[Final['Status']=='Finished','Bonus']=Final['Cost']*0.05

Final

,ID,Project,Cost,Status,First Name,Last Name,Gender,City,Age,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,John,Alter,M,Paris,25,2,50100
1,A002,Project 2,2000000.0,Ongoing,Alice,Luxumberg,F,London,27,2,0
2,A003,Project 3,4500000.0,Finished,Tom,Sabestine,M,Berlin,29,3,225000
3,A004,Project 4,5500000.0,Ongoing,Nina,Adgra,F,Newyork,31,2,0
4,A005,Project 5,3250500.0,Finished,Amy,Johny,F,Madrid,30,3,162525
5,A002,Project 6,680000.0,Failed,Alice,Luxumberg,F,London,27,2,0
6,A005,Project 7,400000.0,Finished,Amy,Johny,F,Madrid,30,3,20000
7,A003,Project 8,350000.0,Failed,Tom,Sabestine,M,Berlin,29,3,0
8,A001,Project 9,2210312.0,Ongoing,John,Alter,M,Paris,25,2,0
9,A003,Project 10,300000.0,Finished,Tom,Sabestine,M,Berlin,29,3,15000
10,A001,Project 11,2000000.0,Failed,John,Alter,M,Paris,25,2,0
11,A004,Project 12,1000000.0,Ongoing,Nina,Adgra,F,Newyork,31,2,0
12,A004,Project 13,3000000.0,Finished,Nina,Adgra,F,Newyork,31,2,150000
13,A005,Project 14,200000.0,Finished,Amy,Johny,F,Madrid,30,3,10000

### <u>Task 6</u> 
Demote the designation level by 1, whose projects have status "fail". Delete the employees record whose designation level is above 4.

In [7]:
# Demote employees whose project status is 'Failed'
Final.loc[Final['Status']=='Failed','Designation Level']+=1

# Delete employees whose designation level is above 4 
Final.drop(Final[Final['Designation Level']>4].index,axis=0,inplace=True)
Final

,ID,Project,Cost,Status,First Name,Last Name,Gender,City,Age,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,John,Alter,M,Paris,25,2,50100
1,A002,Project 2,2000000.0,Ongoing,Alice,Luxumberg,F,London,27,2,0
2,A003,Project 3,4500000.0,Finished,Tom,Sabestine,M,Berlin,29,3,225000
3,A004,Project 4,5500000.0,Ongoing,Nina,Adgra,F,Newyork,31,2,0
4,A005,Project 5,3250500.0,Finished,Amy,Johny,F,Madrid,30,3,162525
5,A002,Project 6,680000.0,Failed,Alice,Luxumberg,F,London,27,3,0
6,A005,Project 7,400000.0,Finished,Amy,Johny,F,Madrid,30,3,20000
7,A003,Project 8,350000.0,Failed,Tom,Sabestine,M,Berlin,29,4,0
8,A001,Project 9,2210312.0,Ongoing,John,Alter,M,Paris,25,2,0
9,A003,Project 10,300000.0,Finished,Tom,Sabestine,M,Berlin,29,3,15000
10,A001,Project 11,2000000.0,Failed,John,Alter,M,Paris,25,3,0
11,A004,Project 12,1000000.0,Ongoing,Nina,Adgra,F,Newyork,31,2,0
12,A004,Project 13,3000000.0,Finished,Nina,Adgra,F,Newyork,31,2,150000
13,A005,Project 14,200000.0,Finished,Amy,Johny,F,Madrid,30,3,10000

### <u>Task 7</u>
Add "Mr." and "Mrs." to the first name column and drop the gender column.

In [8]:
# Add 'Mr.' to male employees
Final.loc[Final['Gender']=='M','First Name']="Mr. "+Final['First Name']
# Add 'Mrs.' to female employees
Final.loc[Final['Gender']=='F','First Name']="Mrs. "+Final['First Name']

# Drop the 'Gender' column as it is no longer needed
Final.drop('Gender',axis=1,inplace=True)
Final

,ID,Project,Cost,Status,First Name,Last Name,City,Age,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,Mr. John,Alter,Paris,25,2,50100
1,A002,Project 2,2000000.0,Ongoing,Mrs. Alice,Luxumberg,London,27,2,0
2,A003,Project 3,4500000.0,Finished,Mr. Tom,Sabestine,Berlin,29,3,225000
3,A004,Project 4,5500000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,2,0
4,A005,Project 5,3250500.0,Finished,Mrs. Amy,Johny,Madrid,30,3,162525
5,A002,Project 6,680000.0,Failed,Mrs. Alice,Luxumberg,London,27,3,0
6,A005,Project 7,400000.0,Finished,Mrs. Amy,Johny,Madrid,30,3,20000
7,A003,Project 8,350000.0,Failed,Mr. Tom,Sabestine,Berlin,29,4,0
8,A001,Project 9,2210312.0,Ongoing,Mr. John,Alter,Paris,25,2,0
9,A003,Project 10,300000.0,Finished,Mr. Tom,Sabestine,Berlin,29,3,15000
10,A001,Project 11,2000000.0,Failed,Mr. John,Alter,Paris,25,3,0
11,A004,Project 12,1000000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,2,0
12,A004,Project 13,3000000.0,Finished,Mrs. Nina,Adgra,Newyork,31,2,150000
13,A005,Project 14,200000.0,Finished,Mrs. Amy,Johny,Madrid,30,3,10000

### <u>Task 8</u>
Promote designation level by 1 for the employees whose age is more than 29 years using IF condition.

In [9]:
# Promote employees with age greater than 29 by 1 level
for i in range(len(Final)):
    if Final.loc[i,'Age']>29:
        Final.loc[i,'Designation Level']-=1

Final

,ID,Project,Cost,Status,First Name,Last Name,City,Age,Designation Level,Bonus
0,A001,Project 1,1002000.0,Finished,Mr. John,Alter,Paris,25,2,50100
1,A002,Project 2,2000000.0,Ongoing,Mrs. Alice,Luxumberg,London,27,2,0
2,A003,Project 3,4500000.0,Finished,Mr. Tom,Sabestine,Berlin,29,3,225000
3,A004,Project 4,5500000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,1,0
4,A005,Project 5,3250500.0,Finished,Mrs. Amy,Johny,Madrid,30,2,162525
5,A002,Project 6,680000.0,Failed,Mrs. Alice,Luxumberg,London,27,3,0
6,A005,Project 7,400000.0,Finished,Mrs. Amy,Johny,Madrid,30,2,20000
7,A003,Project 8,350000.0,Failed,Mr. Tom,Sabestine,Berlin,29,4,0
8,A001,Project 9,2210312.0,Ongoing,Mr. John,Alter,Paris,25,2,0
9,A003,Project 10,300000.0,Finished,Mr. Tom,Sabestine,Berlin,29,3,15000
10,A001,Project 11,2000000.0,Failed,Mr. John,Alter,Paris,25,3,0
11,A004,Project 12,1000000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,1,0
12,A004,Project 13,3000000.0,Finished,Mrs. Nina,Adgra,Newyork,31,1,150000
13,A005,Project 14,200000.0,Finished,Mrs. Amy,Johny,Madrid,30,2,10000

### <u>Task 9</u>
Add the cost of all projects for each Employee and save it in new dataframe "TotalProjCost" with three columns ID, First Name, and Total Cost

In [10]:
# Grouped by ID and First Name to get total project cost
TotalProjCost=Final.groupby(['ID','First Name'])['Cost'].sum().reset_index()

# Rename 'cost' column to 'Total Cost'
TotalProjCost.rename(columns={'Cost':'Total Cost'},inplace=True)

TotalProjCost

     ID  First Name  Total Cost
0  A001    Mr. John   5212312.0
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

### <u>Task 10</u>
Print all the employee details whose city name contains the letter "O" in it

In [11]:
# Filter employees whose city contains 'o' or 'O'
EmployeeWithO=Final[Final['City'].str.contains('o',case=False)]
EmployeeWithO

,ID,Project,Cost,Status,First Name,Last Name,City,Age,Designation Level,Bonus
1,A002,Project 2,2000000.0,Ongoing,Mrs. Alice,Luxumberg,London,27,2,0
3,A004,Project 4,5500000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,1,0
5,A002,Project 6,680000.0,Failed,Mrs. Alice,Luxumberg,London,27,3,0
11,A004,Project 12,1000000.0,Ongoing,Mrs. Nina,Adgra,Newyork,31,1,0
12,A004,Project 13,3000000.0,Finished,Mrs. Nina,Adgra,Newyork,31,1,150000